Core Template MRF - kEpsilon/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kEpsilon;
    // RASModel        realizableKE;
    // RASModel        SpalartAllmaras;
    //RASModel        kOmegaSST;
    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
