Core Template MRF - kEpsilon/constant/MRFProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../Parameters/rotational_parameters.cpp"

MRF1
{
    cellZone    innerCylinder;
    active      yes;

    // No solid patches inside the rotating cellZone need to be exempted.
    nonRotatingPatches ();

    origin    (0 0 0);
    axis      (0 1 0);
    omega     $omega_val;
}

// ************************************************************************* //
