Core Template MRF - kEpsilon/system/surfaces
surfaces
{
    type            surfaces;
    libs            (sampling);
    writeControl    writeTime;

    interpolationScheme  cellPoint;

    surfaceFormat   vtk;
    fields          (p U Q);

    // interpolationScheme cellPoint;  //<- default

    surfaces
    {
        zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 0);
                normal  (0 0 1);
            }
            interpolate     true;
        }

        isoQ
        {
            type            isoSurface;
            isoField        Q;
            isoValue        1000;
            interpolate     true;
        }

        propeller
        {
            type            patch;
            patches         ("propeller.*");
            interpolate     true;
            invariant       true;  // Unaffected by mesh motion
            surfaceFormat   ensight;
        }
    }
}


// ************************************************************************* //
